app/Controllers/admin/ArtikelController.php

UPDATE `tb_artikel` SET `foto_artikel` = '1724819338_9e60d2736529cf86079c.jpeg', `judul_artikel` = 'abcde', `id_kategori` = '2', `deskripsi_artikel` = 'asasaa fxcxcxzcxcc hjhknk ', `tags` = '#cvcvc4', `slug` = 'dsdscxcvcvcvk'
WHERE `tb_artikel`.`id_artikel` IN ('1')
---
    public function update($id)
    {
        $model = new ArtikelModel();
        $artikel = $model->find($id);

        // Mendapatkan file yang diunggah
        $file = $this->request->getFile('foto_artikel');

        // Mengecek apakah ada file yang diunggah
        if ($file && !$file->hasMoved()) {
            // Nama file baru
            $newFileName = $file->getRandomName();

            // Pindahkan file ke folder uploads
            $file->move('uploads/upload_artikel/', $newFileName);

            // Tambahkan nama file baru ke data yang akan diupdate
            $data['foto_artikel'] = $newFileName;
        }

        // Data lain yang diupdate
        $data['judul_artikel'] = $this->request->getPost('judul_artikel');
        $data['id_kategori'] = $this->request->getPost('id_kategori');
        $data['deskripsi_artikel'] = $this->request->getPost('deskripsi_artikel');
        $data['tags'] = $this->request->getPost('tags');
        $data['slug'] = $this->request->getPost('slug');

        // Update data ke database
        $model->update($id, $data);