app/Controllers/admin/ArtikelController.php

SELECT *
FROM `tb_artikel`
ORDER BY `created_at` DESC
---
    public function index()
    {
        // Mengambil semua data artikel dari tabel tb_artikel
        $all_data_artikel = $this->artikelModel->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `tb_kategori`
---
    public function edit($id)
    {
        // Mengambil artikel berdasarkan ID
        $artikel = $this->artikelModel->find($id);

        // Jika artikel tidak ditemukan, kembalikan dengan pesan error
        if (!$artikel) {
            return redirect()->to('/admin/artikel/index')->with('error', 'Artikel tidak ditemukan.');
        }

        // Mengambil semua data kategori dari tabel 'kategori'
        $kategori = $this->kategoriModel->findAll();

SELECT *
FROM `tb_artikel`
WHERE `tb_artikel`.`id_artikel` = '2'
DELETE FROM `tb_artikel`
WHERE `id_artikel` IN ('2')
---
    public function delete($id_artikel)
    {
        // Temukan artikel berdasarkan ID
        $artikel = $this->artikelModel->find($id_artikel);

        if ($artikel) {
            // Hapus file gambar jika ada
            $pathToFile = 'uploads/upload_artikel/' . $artikel['foto_artikel'];
            if (!empty($artikel['foto_artikel']) && file_exists($pathToFile)) {
                if (!unlink($pathToFile)) {
                    // Jika file tidak bisa dihapus, mungkin ingin menambahkan log atau penanganan kesalahan.
                    return redirect()->to(base_url('admin/artikel/index'))->with('error', 'Gagal menghapus file gambar.');
                }
            }

            // Hapus data artikel dari database
            if (!$this->artikelModel->delete($id_artikel)) {