app/Controllers/admin/Dashboardctrl.php

    public function index()
    {
        // Pengecekan apakah pengguna sudah login atau belum
        if (!session()->get('logged_in')) {
            // Jika pengguna belum login, arahkan ke halaman login
            return redirect()->to(base_url('login'));
        }

        // Periksa peran pengguna
        $role = session()->get('role');
        if ($role !== 'admin') {
            // Jika peran bukan admin, arahkan ke halaman lain (misal: user)
            return redirect()->to(base_url('/')); // Sesuaikan dengan URL halaman user
        }

        // Mengakses data dari model sesuai kebutuhan
        $data['totalDPC'] = $this->DPCModels->countAll(); // Count all records in DPCModels
        $data['totalDPD'] = $this->DPDModels->countAll(); // Count all records in DPDModels
        $data['totalMember'] = $this->MemberModels->where('role', 'user')->countAllResults(); // Count members with role 'user' in MemberModels
        $data['totalPengumuman'] = $this->PengumumanModels->countAll(); // Count all records in PengumumanModels
        $data['totalKategoriVideo'] = $this->KategoriVideoModels->countAll(); // Count all records in KategoriVideoModels
        $data['totalVideoPembelajaran'] = $this->VideoPembelajaranModels->countAll(); // Count all records in VideoPembelajaranModels
---
SELECT COUNT(*) AS `numrows` FROM `tb_dpc`
SELECT COUNT(*) AS `numrows` FROM `tb_dpd`
SELECT COUNT(*) AS `numrows`
FROM `tb_member`
WHERE `role` = 'user'
SELECT COUNT(*) AS `numrows` FROM `tb_pengumuman`
SELECT COUNT(*) AS `numrows` FROM `tb_kategori_video`
SELECT COUNT(*) AS `numrows` FROM `tb_video`