app/Controllers/admin/Kategori.php

SELECT *
FROM `tb_kategori`
---
    public function index()
    {
        $data['all_data_kategori'] = $this->kategoriModel->findAll();