app/Controllers/user/Videoctrl.php

SELECT *
FROM `tb_video`
SELECT *
FROM `tb_dpd`
SELECT *
FROM `tb_kategori_video`
SELECT *
FROM `tb_member`
---
    public function index()
    {
        $data = [
            'videoCategories' => $this->kategoriVideoModels->findAll(),
            'videos' => $this->videoPembelajaranModels->findAll(),
            'memberCategories' => $this->memberModels->findAll(), // Fetch member categories
            'dpd' => $this->DPDModels->findAll(),

        ];

SELECT *
FROM `tb_video`
WHERE `id_katvideo` = '1'
SELECT *
FROM `tb_dpd`
---
    public function indexByCategory($id_katvideo)
    {
        $data = [
            'videoCategories' => $this->kategoriVideoModels->findAll(),
            'videos' => $this->videoPembelajaranModels->where('id_katvideo', $id_katvideo)->findAll(),
            'dpd' => $this->DPDModels->findAll(),