app/Controllers/user/Videoctrl.php

    public function videoCategories()
    {
        // Fetch all video categories
        $data['videoCategories'] = $this->kategoriVideoModels->findAll();
---
SELECT *
FROM `tb_kategori_video`