app/Models/VideoPembelajaranModels.php

    public function getAllVideosWithCategory()
    {
        return $this->select('tb_video.*, tb_kategori_video.nama_kategori_video')
                    ->join('tb_kategori_video', 'tb_kategori_video.id_katvideo = tb_video.id_katvideo', 'left')
                    ->findAll();
---
SELECT `tb_video`.*, `tb_kategori_video`.`nama_kategori_video`
FROM `tb_video`
LEFT JOIN `tb_kategori_video` ON `tb_kategori_video`.`id_katvideo` = `tb_video`.`id_katvideo`